#### Terraform Format and Style 🖌`failure`
#### production - Terraform Initialization ⚙️`success`
#### production - Terraform Validation 🤖Success! The configuration is valid.


#### production - Terraform Plan 📖`success`

<details><summary>production - Show Plan</summary>

```terraform
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-production/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-production/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[16]: Refreshing state... [id=terra-datarepo-production/cloudkms.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-production/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-production/compute.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-production/dns.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-production/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-production/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-production/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-production/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-production/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-production/logging.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-production/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-production/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-production/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-production/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-production/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-production/container.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-production/storage-api.googleapis.com]
module.core-infrastructure.google_kms_key_ring.db: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/keyRings/jade-db]
module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access: Refreshing state... [id=terra-datarepo-production/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_service_account.node_pool: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-production/global/sslPolicies/global-ssl-policy]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-production/global/networks/production-network]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-production/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/subnetworks/production-subnet]
module.core-infrastructure.google_project_iam_member.node_pool[2]: Refreshing state... [id=terra-datarepo-production/roles/logging.logWriter/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[3]: Refreshing state... [id=terra-datarepo-production/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[0]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.viewer/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_project_iam_member.node_pool[1]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.metricWriter/serviceaccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.core-infrastructure.google_kms_crypto_key.db: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/keyRings/jade-db/cryptoKeys/jade]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-production/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-production/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-2"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-2-cis-highmem]
module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=MhNUqvJm2Mlbx-sJadLRSw]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/jade-production-ip]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=t7FkZ3VyrruPNDAijW0kww]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=g2vmw5_ZvyUrKPv8jKBRKQ]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=GU6X8it2Z8Y]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.module.sql_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-production/roles/cloudtrace.agent/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-production/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-production/roles/viewer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-production/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-production/roles/cloudprofiler.agent/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-production/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.editor/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-production/roles/iam.serviceAccountTokenCreator/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-production/roles/pubsub.editor/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-production/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-production/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[7]: Refreshing state... [id=folders/43241207445/roles/resourcemanager.projectMover/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[2]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.projectCreator/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[9]: Refreshing state... [id=folders/43241207445/roles/owner/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[1]: Refreshing state... [id=folders/43241207445/roles/resourcemanager.folderAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[5]: Refreshing state... [id=folders/43241207445/roles/resourcemanager.projectDeleter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[11]: Refreshing state... [id=folders/43241207445/roles/iam.serviceAccountTokenCreator/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[4]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.projectDeleter/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[10]: Refreshing state... [id=folders/815384374864/roles/iam.serviceAccountTokenCreator/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[8]: Refreshing state... [id=folders/815384374864/roles/owner/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[0]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.folderAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[3]: Refreshing state... [id=folders/43241207445/roles/resourcemanager.projectCreator/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.google_folder_iam_member.app_folder_roles[6]: Refreshing state... [id=folders/815384374864/roles/resourcemanager.projectMover/serviceaccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-api-sa]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-production%2Fglobal%2Fnetworks%2Fproduction-network:servicenetworking.googleapis.com]
module.datarepo-app.module.sql_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/datarepo-jade-sqlproxy@terra-datarepo-production.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.module.sql_workloadid.google_project_iam_member.service-account-role["roles/cloudsql.client"]: Refreshing state... [id=terra-datarepo-production/roles/cloudsql.client/serviceaccount:datarepo-jade-sqlproxy@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-production/instances/datarepo-db-jade-194e97f22b7667c6/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-194e97f22b7667c6]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/production/datarepo-sql-db]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-production/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-production/notificationChannels/464975950067283356]
module.datarepo-alerts.google_monitoring_notification_channel.workbench_notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-production/notificationChannels/6446377545950012706]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-production/uptimeCheckConfigs/data-terra-bio]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/828731061248504616]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/12610221002304665649]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/17668203417845901091]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-production/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-production/serviceAccounts/prometheus-sa@terra-datarepo-production.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-production/alertPolicies/9202628085327048402]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.core-infrastructure.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      ~ billing_account     = "00708C-45D19D-27AAFA" -> (known after apply)
      ~ folder_id           = "739699890450" -> (known after apply)
      ~ id                  = "projects/terra-datarepo-production" -> (known after apply)
      ~ labels              = {
          - "billing"    = "00708c-45d19d-27aafa"
          - "costobject" = "broad-8201528"
        } -> (known after apply)
      ~ name                = "terra-datarepo-production" -> (known after apply)
      ~ number              = "545052482238" -> (known after apply)
      + org_id              = (known after apply)
      - project_id          = "terra-datarepo-production" -> null
      + skip_delete         = (known after apply)
    }

  # module.core-infrastructure.google_project_iam_binding.kubernetes_engine_kms_access will be updated in-place
  ~ resource "google_project_iam_binding" "kubernetes_engine_kms_access" {
        id      = "terra-datarepo-production/roles/cloudkms.cryptoKeyEncrypterDecrypter"
      ~ members = [
          - "serviceAccount:gke-node-sa@terra-datarepo-production.iam.gserviceaccount.com",
          - "serviceAccount:service-545052482238@container-engine-robot.iam.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
      ~ display_name = "jade-alerts" -> "production"
        id           = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
        name         = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
        # (5 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.workbench_notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "workbench_notification_channel" {
        id           = "projects/terra-datarepo-production/notificationChannels/6446377545950012706"
        name         = "projects/terra-datarepo-production/notificationChannels/6446377545950012706"
        # (6 unchanged attributes hidden)

      ~ sensitive_labels {
          ~ auth_token = (sensitive value)
        }
    }

  # module.datarepo-app.google_service_account_key.api_sa_key[0] will be created
  + resource "google_service_account_key" "api_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = "projects/terra-datarepo-production/serviceAccounts/datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com"
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.enable-services.google_project_service.required-services[17] will be created
  + resource "google_project_service" "required-services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terra-datarepo-production"
      + service            = "appengine.googleapis.com"
    }

  # module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-1"].google_container_node_pool.pool[0] will be updated in-place
  ~ resource "google_container_node_pool" "pool" {
        id                  = "projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1-cis-highmem"
        name                = "jade-node-us-central-1-cis-highmem"
        # (9 unchanged attributes hidden)


      ~ node_config {
          ~ image_type        = "COS_CONTAINERD" -> "COS"
            tags              = [
                "terra-datarepo-production",
                "jade",
                "kubernetes",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.core-infrastructure.module.k8s-cis-nodes-highmem["jade-node-us-central-2"].google_container_node_pool.pool[0] will be updated in-place
  ~ resource "google_container_node_pool" "pool" {
        id                  = "projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-2-cis-highmem"
        name                = "jade-node-us-central-2-cis-highmem"
        # (9 unchanged attributes hidden)


      ~ node_config {
          ~ image_type        = "COS_CONTAINERD" -> "COS"
            tags              = [
                "terra-datarepo-production",
                "jade",
                "kubernetes",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_engine_versions" "cluster_versions"  {
      ~ default_cluster_version         = "1.24.7-gke.900" -> (known after apply)
      ~ id                              = "2023-01-20 17:45:02.286793624 +0000 UTC" -> (known after apply)
      + latest_master_version           = (known after apply)
      ~ latest_node_version             = "1.17.14-gke.400" -> (known after apply)
      ~ release_channel_default_version = {
          - "RAPID"   = "1.25.4-gke.2100"
          - "REGULAR" = "1.24.7-gke.900"
          - "STABLE"  = "1.23.13-gke.900"
        } -> (known after apply)
      ~ valid_master_versions           = [] -> (known after apply)
      ~ valid_node_versions             = [
          - "1.17.14-gke.400",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1"
      + min_master_version          = (known after apply)
        name                        = "jade-master-us-central1"
        # (26 unchanged attributes hidden)















        # (16 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts will be updated in-place
  ~ resource "google_monitoring_alert_policy" "node_resource_alerts" {
        id                    = "projects/terra-datarepo-production/alertPolicies/17668203417845901091"
        name                  = "projects/terra-datarepo-production/alertPolicies/17668203417845901091"
      ~ notification_channels = [
          - "projects/terra-datarepo-production/notificationChannels/14780908774727605792",
          + "projects/terra-datarepo-production/notificationChannels/464975950067283356",
          + "projects/terra-datarepo-production/notificationChannels/6446377545950012706",
        ]
        # (6 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert will be updated in-place
  ~ resource "google_monitoring_alert_policy" "pod_health_alert" {
        id                    = "projects/terra-datarepo-production/alertPolicies/828731061248504616"
        name                  = "projects/terra-datarepo-production/alertPolicies/828731061248504616"
      ~ notification_channels = [
          - "projects/terra-datarepo-production/notificationChannels/14780908774727605792",
          + "projects/terra-datarepo-production/notificationChannels/464975950067283356",
          + "projects/terra-datarepo-production/notificationChannels/6446377545950012706",
        ]
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util will be updated in-place
  ~ resource "google_monitoring_alert_policy" "pod_memory_util" {
        id                    = "projects/terra-datarepo-production/alertPolicies/12610221002304665649"
        name                  = "projects/terra-datarepo-production/alertPolicies/12610221002304665649"
      ~ notification_channels = [
          - "projects/terra-datarepo-production/notificationChannels/14780908774727605792",
          + "projects/terra-datarepo-production/notificationChannels/464975950067283356",
          + "projects/terra-datarepo-production/notificationChannels/6446377545950012706",
        ]
        # (6 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0] will be updated in-place
  ~ resource "google_monitoring_alert_policy" "uptime-check" {
        id                    = "projects/terra-datarepo-production/alertPolicies/9202628085327048402"
        name                  = "projects/terra-datarepo-production/alertPolicies/9202628085327048402"
      ~ notification_channels = [
          - "projects/terra-datarepo-production/notificationChannels/14780908774727605792",
          + "projects/terra-datarepo-production/notificationChannels/464975950067283356",
          + "projects/terra-datarepo-production/notificationChannels/6446377545950012706",
        ]
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be updated in-place
  ~ resource "google_sql_database_instance" "cloudsql_instance" {
        id                            = "datarepo-db-jade-194e97f22b7667c6"
        name                          = "datarepo-db-jade-194e97f22b7667c6"
        # (11 unchanged attributes hidden)

      ~ settings {
            # (12 unchanged attributes hidden)

          ~ backup_configuration {
              - location                       = "us" -> null
                # (4 unchanged attributes hidden)
            }

          - database_flags {
              - name  = "max_locks_per_transaction" -> null
              - value = "100" -> null
            }



          - maintenance_window {
              - day  = 0 -> null
              - hour = 0 -> null
            }
            # (3 unchanged blocks hidden)
        }
    }

Plan: 2 to add, 11 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @snf2ye, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*